SubscriberService/src/test/resources/exampleRequests/DeliverMIDASTrafficDataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<d2lm:d2LogicalModel xmlns:d2lm="http://datex2.eu/schema/2/2_0"
			modelBaseVersion="2" extensionName="NTIS Published Services"
			extensionVersion="2.0">
			<d2lm:exchange>
				<d2lm:supplierIdentification>
					<d2lm:country>gb</d2lm:country>
					<d2lm:nationalIdentifier>NTIS</d2lm:nationalIdentifier>
				</d2lm:supplierIdentification>
			</d2lm:exchange>
			<d2lm:payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				xsi:type="d2lm:MeasuredDataPublication" lang="en">
				<d2lm:feedType>MIDAS Loop Traffic Data</d2lm:feedType>
				<d2lm:publicationTime>2013-07-10T14:59:10.421+01:00</d2lm:publicationTime>
				<d2lm:publicationCreator>
					<d2lm:country>gb</d2lm:country>
					<d2lm:nationalIdentifier>NTIS</d2lm:nationalIdentifier>
				</d2lm:publicationCreator>
				<d2lm:measurementSiteTableReference
					targetClass="MeasurementSiteTable" version="56.0"
					id="NTIS_MIDAS_Measurement_Sites" />
				<d2lm:headerInformation>
					<d2lm:confidentiality>restrictedToAuthoritiesTrafficOperatorsAndPublishers</d2lm:confidentiality>
					<d2lm:informationStatus>real</d2lm:informationStatus>
					<d2lm:urgency>normalUrgency</d2lm:urgency>
				</d2lm:headerInformation>
				<d2lm:siteMeasurements>
					<d2lm:measurementSiteReference
						targetClass="MeasurementSiteRecord" version="56.0"
						id="8C5428D934044877AD6497A34BE91760" />
					<d2lm:measurementTimeDefault>2014-02-05T14:58:23.001Z</d2lm:measurementTimeDefault>
					<d2lm:measuredValue index="0">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
								<d2lm:averageVehicleSpeed>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:speed>10.0</d2lm:speed>
								</d2lm:averageVehicleSpeed>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="1">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficHeadway">
								<d2lm:averageTimeHeadway>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:duration>175.0</d2lm:duration>
								</d2lm:averageTimeHeadway>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="2">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficConcentration">
								<d2lm:occupancy>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:percentage>10.0</d2lm:percentage>
								</d2lm:occupancy>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="3">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>true</d2lm:dataError>
									<d2lm:reasonForDataError>
                						<d2lm:values>
                  							<d2lm:value>suspect equipment</d2lm:value>
                						</d2lm:values>
              						</d2lm:reasonForDataError>
									<d2lm:vehicleFlowRate>35</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="4">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>40</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="5">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>45</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="6">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>50</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="8">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
								<d2lm:averageVehicleSpeed>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:speed>20.0</d2lm:speed>
								</d2lm:averageVehicleSpeed>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="9">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficHeadway">
								<d2lm:averageTimeHeadway>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:duration>176.0</d2lm:duration>
								</d2lm:averageTimeHeadway>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="10">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficConcentration">
								<d2lm:occupancy>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:percentage>20.0</d2lm:percentage>
								</d2lm:occupancy>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="11">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>36</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="12">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>41</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="13">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>46</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="14">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>51</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="16">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
								<d2lm:averageVehicleSpeed>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:speed>30.0</d2lm:speed>
								</d2lm:averageVehicleSpeed>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="17">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficHeadway">
								<d2lm:averageTimeHeadway>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:duration>177.0</d2lm:duration>
								</d2lm:averageTimeHeadway>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="18">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficConcentration">
								<d2lm:occupancy>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:percentage>30.0</d2lm:percentage>
								</d2lm:occupancy>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="19">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>37</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="20">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>42</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="21">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>47</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="22">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>52</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="24">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
								<d2lm:averageVehicleSpeed>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:speed>40.0</d2lm:speed>
								</d2lm:averageVehicleSpeed>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="25">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficHeadway">
								<d2lm:averageTimeHeadway>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:duration>178.0</d2lm:duration>
								</d2lm:averageTimeHeadway>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="26">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficConcentration">
								<d2lm:occupancy>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:percentage>40.0</d2lm:percentage>
								</d2lm:occupancy>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="27">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>38</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="28">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>43</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="29">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>48</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="30">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>53</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
				</d2lm:siteMeasurements>
			</d2lm:payloadPublication>
		</d2lm:d2LogicalModel>
	</soapenv:Body>
</soapenv:Envelope>