SubscriberService/src/test/resources/exampleRequests/DeliverAverageSpeedFusedDataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<d2lm:d2LogicalModel modelBaseVersion="2"
			extensionName="NTIS Published Services" extensionVersion="1.0"
			xmlns:d2lm="http://datex2.eu/schema/2/2_0">
			<d2lm:exchange>
				<d2lm:supplierIdentification>
					<d2lm:country>gb</d2lm:country>
					<d2lm:nationalIdentifier>NTIS</d2lm:nationalIdentifier>
				</d2lm:supplierIdentification>
			</d2lm:exchange>
			<d2lm:payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				xsi:type="d2lm:ElaboratedDataPublication" lang="en">
				<d2lm:feedType>Fused FVD and Sensor PTD</d2lm:feedType>
				<d2lm:publicationTime>2012-02-08T10:55:46.020Z
				</d2lm:publicationTime>
				<d2lm:publicationCreator>
					<d2lm:country>gb</d2lm:country>
					<d2lm:nationalIdentifier>NTIS</d2lm:nationalIdentifier>
				</d2lm:publicationCreator>
				<d2lm:forecastDefault>false</d2lm:forecastDefault>

				<d2lm:timeDefault>2012-02-08T10:55:46.020Z</d2lm:timeDefault>
				<d2lm:headerInformation>
					<d2lm:areaOfInterest>national</d2lm:areaOfInterest>
					<d2lm:confidentiality>restrictedToAuthoritiesTrafficOperatorsAndPublishers
					</d2lm:confidentiality>
					<d2lm:informationStatus>real</d2lm:informationStatus>
				</d2lm:headerInformation>
				<!-- Current Speed Data -->
				<d2lm:elaboratedData>
					<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
						<d2lm:pertinentLocation xsi:type="d2lm:LocationByReference">
							<d2lm:predefinedLocationReference
								targetClass="PredefinedLocation" id="1" version="17.0" />
						</d2lm:pertinentLocation>
						<d2lm:averageVehicleSpeed>
							<d2lm:speed>10.0</d2lm:speed>
						</d2lm:averageVehicleSpeed>
						<d2lm:trafficSpeedExtension>
							<d2lm:speedFvdOnly>
								<d2lm:speed>10.0</d2lm:speed>
							</d2lm:speedFvdOnly>
						</d2lm:trafficSpeedExtension>
					</d2lm:basicData>
				</d2lm:elaboratedData>
				<!-- Current Travel Time Data -->
				<d2lm:elaboratedData>
					<d2lm:basicData xsi:type="d2lm:TravelTimeData">
						<d2lm:pertinentLocation xsi:type="d2lm:LocationByReference">
							<d2lm:predefinedLocationReference
								targetClass="PredefinedLocation" id="2" version="17.0" />
						</d2lm:pertinentLocation>
						<d2lm:travelTime>
							<d2lm:duration>1</d2lm:duration>
						</d2lm:travelTime>
						<d2lm:freeFlowTravelTime>
							<d2lm:duration>1</d2lm:duration>
						</d2lm:freeFlowTravelTime>
						<d2lm:normallyExpectedTravelTime>
							<d2lm:duration>1</d2lm:duration>
						</d2lm:normallyExpectedTravelTime>
					</d2lm:basicData>
				</d2lm:elaboratedData>
				<!-- Speed Predictions -->
				<d2lm:elaboratedData>
					<d2lm:forecast>true</d2lm:forecast>
					<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
						<d2lm:measurementOrCalculationTime>[forecast time]
						</d2lm:measurementOrCalculationTime>
						<d2lm:pertinentLocation xsi:type="d2lm:LocationByReference">
							<d2lm:predefinedLocationReference
								targetClass="PredefinedLocation" id="1" version="17.0" />
						</d2lm:pertinentLocation>
						<d2lm:averageVehicleSpeed>
							<d2lm:speed>[forecast fused average speed]</d2lm:speed>
						</d2lm:averageVehicleSpeed>
					</d2lm:basicData>
				</d2lm:elaboratedData>
				<!-- x 8 – Speed predictions are specified for the next 2hrs at 15min 
					intervals -->
				<!-- Travel Time Predictions -->
				<d2lm:elaboratedData>
					<d2lm:forecast>true</d2lm:forecast>
					<d2lm:basicData xsi:type="d2lm:TravelTimeData">
						<d2lm:measurementOrCalculationTime>[forecast time]
						</d2lm:measurementOrCalculationTime>
						<d2lm:pertinentLocation xsi:type="d2lm:LocationByReference">
							<d2lm:predefinedLocationReference
								targetClass="PredefinedLocation" id="1" version="17.0" />
						</d2lm:pertinentLocation>
						<d2lm:travelTime>
							<d2lm:duration>1</d2lm:duration>
						</d2lm:travelTime>
					</d2lm:basicData>
				</d2lm:elaboratedData>
			</d2lm:payloadPublication>
		</d2lm:d2LogicalModel>
	</soapenv:Body>
</soapenv:Envelope>