src/test/resources/mst_for_radius.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP:Body>
		<d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			modelBaseVersion="2">
			<exchange>
				<supplierIdentification>
					<country>nl</country>
					<nationalIdentifier>NLNDW</nationalIdentifier>
				</supplierIdentification>
			</exchange>
			<payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				xsi:type="MeasurementSiteTablePublication" lang="nl">
				<publicationTime>2016-09-07T11:00:00.000Z</publicationTime>
				<publicationCreator>
					<country>nl</country>
					<nationalIdentifier>NLNDW</nationalIdentifier>
				</publicationCreator>
				<headerInformation>
					<confidentiality>noRestriction</confidentiality>
					<informationStatus>real</informationStatus>
				</headerInformation>
				<measurementSiteTable id="NDW01_MT" version="868">
					<measurementSiteRecord id="PZH01_MST_0004_00"
						version="12">
						<measurementSiteRecordVersionTime>2014-11-26T12:00:00Z
						</measurementSiteRecordVersionTime>
						<computationMethod>arithmeticAverageOfSamplesInATimePeriod
						</computationMethod>
						<measurementEquipmentReference>0004_00
						</measurementEquipmentReference>
						<measurementEquipmentTypeUsed>
							<values>
								<value lang="nl">lus</value>
							</values>
						</measurementEquipmentTypeUsed>
						<measurementSiteName>
							<values>
								<value lang="nl">N206 km 8.024</value>
							</values>
						</measurementSiteName>
						<measurementSiteNumberOfLanes>2</measurementSiteNumberOfLanes>
						<measurementSpecificCharacteristics index="1">
							<measurementSpecificCharacteristics>
								<accuracy>95</accuracy>
								<period>60</period>
								<specificLane>lane1</specificLane>
								<specificMeasurementValueType>trafficFlow
								</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<lengthCharacteristic>
										<comparisonOperator>lessThan</comparisonOperator>
										<vehicleLength>5.6</vehicleLength>
									</lengthCharacteristic>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>						
						<measurementSiteLocation xsi:type="Point">
							<locationForDisplay>
								<latitude>52.1223</latitude>
								<longitude>4.49208</longitude>
							</locationForDisplay>
							<supplementaryPositionalDescription>
								<affectedCarriagewayAndLanes>
									<carriageway>mainCarriageway</carriageway>
								</affectedCarriagewayAndLanes>
							</supplementaryPositionalDescription>
							<alertCPoint xsi:type="AlertCMethod4Point">
								<alertCLocationCountryCode>8</alertCLocationCountryCode>
								<alertCLocationTableNumber>5.11</alertCLocationTableNumber>
								<alertCLocationTableVersion>A</alertCLocationTableVersion>
								<alertCDirection>
									<alertCDirectionCoded>positive</alertCDirectionCoded>
								</alertCDirection>
								<alertCMethod4PrimaryPointLocation>
									<alertCLocation>
										<specificLocation>10822</specificLocation>
									</alertCLocation>
									<offsetDistance>
										<offsetDistance>1124</offsetDistance>
									</offsetDistance>
								</alertCMethod4PrimaryPointLocation>
							</alertCPoint>
						</measurementSiteLocation>
					</measurementSiteRecord>
					
					<measurementSiteRecord id="PZH02_MST_0004_00"
						version="12">
						<measurementSiteRecordVersionTime>2014-11-26T12:00:00Z
						</measurementSiteRecordVersionTime>
						<computationMethod>arithmeticAverageOfSamplesInATimePeriod
						</computationMethod>
						<measurementEquipmentReference>0004_00
						</measurementEquipmentReference>
						<measurementEquipmentTypeUsed>
							<values>
								<value lang="nl">lus</value>
							</values>
						</measurementEquipmentTypeUsed>
						<measurementSiteName>
							<values>
								<value lang="nl">N206 km 8.024</value>
							</values>
						</measurementSiteName>
						<measurementSiteNumberOfLanes>2</measurementSiteNumberOfLanes>
						<measurementSpecificCharacteristics index="1">
							<measurementSpecificCharacteristics>
								<accuracy>95</accuracy>
								<period>60</period>
								<specificLane>lane1</specificLane>
								<specificMeasurementValueType>trafficFlow
								</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<lengthCharacteristic>
										<comparisonOperator>lessThan</comparisonOperator>
										<vehicleLength>5.6</vehicleLength>
									</lengthCharacteristic>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>						
						<measurementSiteLocation xsi:type="Point">
							<locationForDisplay>
								<latitude>53.1223</latitude>
								<longitude>4.49208</longitude>
							</locationForDisplay>
							<supplementaryPositionalDescription>
								<affectedCarriagewayAndLanes>
									<carriageway>mainCarriageway</carriageway>
								</affectedCarriagewayAndLanes>
							</supplementaryPositionalDescription>
							<alertCPoint xsi:type="AlertCMethod4Point">
								<alertCLocationCountryCode>8</alertCLocationCountryCode>
								<alertCLocationTableNumber>5.11</alertCLocationTableNumber>
								<alertCLocationTableVersion>A</alertCLocationTableVersion>
								<alertCDirection>
									<alertCDirectionCoded>positive</alertCDirectionCoded>
								</alertCDirection>
								<alertCMethod4PrimaryPointLocation>
									<alertCLocation>
										<specificLocation>10822</specificLocation>
									</alertCLocation>
									<offsetDistance>
										<offsetDistance>1124</offsetDistance>
									</offsetDistance>
								</alertCMethod4PrimaryPointLocation>
							</alertCPoint>
						</measurementSiteLocation>
					</measurementSiteRecord>
					
					<measurementSiteRecord id="PZH03_MST_0004_00"
						version="12">
						<measurementSiteRecordVersionTime>2014-11-26T12:00:00Z
						</measurementSiteRecordVersionTime>
						<computationMethod>arithmeticAverageOfSamplesInATimePeriod
						</computationMethod>
						<measurementEquipmentReference>0004_00
						</measurementEquipmentReference>
						<measurementEquipmentTypeUsed>
							<values>
								<value lang="nl">lus</value>
							</values>
						</measurementEquipmentTypeUsed>
						<measurementSiteName>
							<values>
								<value lang="nl">N206 km 8.024</value>
							</values>
						</measurementSiteName>
						<measurementSiteNumberOfLanes>2</measurementSiteNumberOfLanes>
						<measurementSpecificCharacteristics index="1">
							<measurementSpecificCharacteristics>
								<accuracy>95</accuracy>
								<period>60</period>
								<specificLane>lane1</specificLane>
								<specificMeasurementValueType>trafficFlow
								</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<lengthCharacteristic>
										<comparisonOperator>lessThan</comparisonOperator>
										<vehicleLength>5.6</vehicleLength>
									</lengthCharacteristic>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>						
						<measurementSiteLocation xsi:type="Point">
							<locationForDisplay>
								<latitude>52.1223</latitude>
								<longitude>4.49208</longitude>
							</locationForDisplay>
							<supplementaryPositionalDescription>
								<affectedCarriagewayAndLanes>
									<carriageway>mainCarriageway</carriageway>
								</affectedCarriagewayAndLanes>
							</supplementaryPositionalDescription>
							<alertCPoint xsi:type="AlertCMethod4Point">
								<alertCLocationCountryCode>8</alertCLocationCountryCode>
								<alertCLocationTableNumber>5.11</alertCLocationTableNumber>
								<alertCLocationTableVersion>A</alertCLocationTableVersion>
								<alertCDirection>
									<alertCDirectionCoded>positive</alertCDirectionCoded>
								</alertCDirection>
								<alertCMethod4PrimaryPointLocation>
									<alertCLocation>
										<specificLocation>10822</specificLocation>
									</alertCLocation>
									<offsetDistance>
										<offsetDistance>1124</offsetDistance>
									</offsetDistance>
								</alertCMethod4PrimaryPointLocation>
							</alertCPoint>
						</measurementSiteLocation>
					</measurementSiteRecord>
				</measurementSiteTable>
			</payloadPublication>
		</d2LogicalModel>
	</SOAP:Body>
</SOAP:Envelope>          
